/*
    На вход дан неупорядоченный набор объектов, каждый из которых помечен одним из трёх
    цветов: красный, зелёный и синий. Также на вход даётся правило, устанавливающее отношение
    порядка между цветами. Требуется упорядочить объекты в соответствии с указанным
    отношением порядка цветов.
            Пример:
            (Обозначения: К, З, С – объекты, помеченные красным, зелёным и синим цветами,
    соответственно.)
    Входной набор объектов:
    С С З С К З З З К К С З С С К З
    Задано следующее отношение порядка цветов:
    З < С < К
    На выходе должен быть следующий набор объектов:
/    З З З З З З С С С С С С К К К К
    Необходимо реализовать описанный алгоритм в виде функции (или метода класса) и написать
    код, тестирующий его.
 */

import java.util.Arrays;

public class ReorderStringArray {
    public static String[] reorder(String[] colorObject) {
        // 'k' сохраняет индекс следующей доступной позиции
        int k = 0;
        Arrays.sort(colorObject);

        // делаем для каждого элемента
        for (int i = 0; i < colorObject.length; i++) {
            // если текущий элемент отличен от "К", поместить элемент в
            // следующую свободную позицию в массиве
            if (!colorObject[i].equals("К")) {
                colorObject[k++] = colorObject[i];
            }
        }

        // перемещаем все "К" в конец массива (оставшиеся индексы)
        for (int i = k; i < colorObject.length; i++) {
            colorObject[i] = "К";
        }
        return colorObject;
    }
}
